Repository: sigma-random/netcat-code
Catalog: po/*.po
Languages: it

source: Cmd line:
it: Riga comando:

source: GNU netcat %s, a rewrite of the famous networking tool.
it: GNU netcat %s, una reimplementazione del famoso tool per networking.

source: Basic usages:
it: Uso di base:

source: connect to somewhere: %s [options] hostname port [port] ...
it: connessione ad un host: %s [opzioni] hostname port [port] ...

source: listen for inbound: %s -l -p port [options] [hostname] [port]
it: attesa connessione: %s -l -p port [opzioni] [hostname] [port]

source: Mandatory arguments to long options are mandatory for short options too.
it: Gli argomenti che sono obbligatori per le istruzioni lunghe lo sono anche per quelle corte.

source: Options: -e, --exec=PROGRAM program to exec after connect -g, --gateway=LIST source-routing hop point[s], up to 8 -G, --pointer=NUM source-routing pointer: 4, 8, 12, ... -h, --help display this help and exit -i, --interval=SECS delay interval for lines sent, ports scanned -l, --listen listen mode, for inbound connects -n, --dont-resolve numeric-only IP addresses, no DNS -o, --output=FILE output hexdump traffic to FILE (implies -x) -p, --local-port=NUM local port number -r, --randomize randomize local and remote ports -s, --source=ADDRESS local source address (ip or hostname) -t, --telnet answer using TELNET negotiation -u, --udp UDP mode -v, --verbose verbose (use twice to be more verbose) -V, --version output version information and exit -x, --hexdump hexdump incoming and outgoing traffic -w, --wait=SECS timeout for connects and final net reads -z, --zero zero-I/O mode (used for scanning)
it: Opzioni: -e, --exec=PROGRAM programma da eseguire dopo la connessione -g, --gateway=LIST source-routing hop point[s], fino a 8 -G, --pointer=NUM source-routing pointer: 4, 8, 12, ... -h, --help mostra questo testo ed esce -i, --interval=SECS intervallo per le righe inviate o porte provate. -l, --listen modalità di ascolto, per le connessioni in entrata -n, --dont-resolve numeric-only IP addresses, no DNS -o, --output=FILE scrivi l'output del traffico sul FILE (implica -x) -p, --local-port=NUM specifica la porta locale usata -r, --randomize randomizza le porte locali e remote -s, --source=ADDRESS specifica l'indirizzo sorgente (ip o hostname) -t, --telnet rispondi alle negoziazioni TELNET -u, --udp modalità UDP -v, --verbose dettagli (due volte significa più dettagli) -V, --version output version information and exit -x, --hexdump hexdump incoming and outgoing traffic -w, --wait=SECS tempo di scadenza per i tentativi di connessioni -z, --zero zero-I/O mode (used for scanning)

source: Remote port number can also be specified as range. Example: '1-1024'
it: La porta remota può essere specificata come intervallo. Esempio: '1-1024'

source: Copyright (C) 2002 Giovanni Giacobbi This program comes with NO WARRANTY, to the extent permitted by law. You may redistribute copies of this program under the terms of the GNU General Public License. For more information about these matters, see the file named COPYING. Original idea and design by Avian Research <hobbit@avian.org>, Written by Giovanni Giacobbi <johnny@themnemonic.org>.
it: Copyright (C) 2002 Giovanni Giacobbi Questo programma viene pubblicato SENZA GARANZIA, con le estensioni consentite dalla legge. E' possibile ridistribuire le copie di questo programma entro i termini stabiliti dalla GNU General Public License. Per ulteriori informazioni a riguardo vedere il file COPYING. Design e idea originale di Avian Research <hobbit@avian.org>, Scritto da Giovanni Giacobbi <johnny@themnemonic.org>.

source: Exiting. Total received bytes: %ld Total sent bytes: %ld
it: Terminato. Totale byte ricevuti: %ld Totale byte inviati: %ld

source: Error: Invalid interval time "%s"
it: Errore: tempo di intervallo non valido "%s"

source: Error: invalid local port: %s
it: Errore: porta locale non valida: %s

source: Error: Couldn't resolve local host: %s
it: Errore: porta locale non valida: %s

source: Error: invalid wait-time: %s
it: Errore: tempo di attesa non valido: %s

source: Try `%s --help' for more information.
it: Usare `%s --help' per ulteriori informazioni.

source: Failed to open output file:
it: Impossibile aprire il file di output:

source: Error: Couldn't resolve host "%s"
it: Errore: Impossibile risolvere l'host "%s"

source: Error: Invalid port specification: %s
it: Errore: porta locale non valida: %s

source: Error: Couldn't setup listen socket (err=%d)
it: Errore: Impossibile creare il socket in attesa (err=%d)

source: Listen mode failed: %s
it: Modalità di attesa fallita: %s

source: Unwanted connection from %s:%d
it: Connessione non voluta da %s:%d

source: Error: No ports specified for connection
it: Errore: Nessuna porta specificata per la connessione

source: Warning: inverse host lookup failed for %s:
it: Attenzione: fallita risoluzione inversa per %s:

source: Warning, this host mismatch! %s - %s
it: Attenzione, questo hostname non rispecchia! %s - %s

source: Error: Inverse name lookup failed for `%s'
it: Errore: Risoluzione inversa fallita per `%s'

source: Warning: direct host lookup failed for %s:
it: Attenzione: Risoluzione fallita per %s:
